Wassertank_grob/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | OpenFOAM (Engys Edition):                                |
|   o   O   o      | Version: 2.2_engysEdition-2.4                            |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ( 0 0 0.0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 0 0 .05 );
    }
    outlet
    {
      type            inletOutlet;
      inletValue   uniform ( 0 0 0 );
      value           uniform ( 0 0 0 );
    }
    "wall.*"
    {
        type           noSlip;
    }
    	
}


// ************************************************************************* //
