Wassertank_grob/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "3/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16;
        startFace       486756;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       486772;
    }
    wall_inlet2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          260;
        startFace       486804;
    }
    wall_distributor1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          29067;
        startFace       487064;
    }
    wall_outlet2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          81;
        startFace       516131;
    }
    wall_Tank
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2930;
        startFace       516212;
    }
    wall_tankoben
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1380;
        startFace       519142;
    }
    wall_tankunten
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1320;
        startFace       520522;
    }
)

// ************************************************************************* //
